In [39]:
import pandas as pd

In [40]:
df = pd.read_csv('tb.csv')
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
df.dropna(inplace=True)
df.reset_index(inplace=True)
df.drop('index', axis=1, inplace=True)
# df.drop('level_0', axis=1, inplace=True)
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,2005,5.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,...,0.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0
1,AD,2006,8.0,0.0,0.0,0.0,1.0,1.0,2.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0
2,AD,2008,3.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0
3,AE,2008,50.0,0.0,0.0,0.0,6.0,1.0,7.0,5.0,...,0.0,0.0,0.0,10.0,4.0,1.0,1.0,3.0,3.0,0.0
4,AL,2005,196.0,0.0,0.0,0.0,26.0,21.0,16.0,31.0,...,0.0,0.0,0.0,3.0,9.0,5.0,5.0,5.0,18.0,0.0

In [42]:
df.drop('new_sp_m014', axis=1, inplace=True)
df.drop('new_sp_f014', axis=1, inplace=True)
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,...,new_sp_mu,new_sp_f04,new_sp_f514,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,2005,5.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0
1,AD,2006,8.0,0.0,0.0,1.0,1.0,2.0,0.0,1.0,...,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0
2,AD,2008,3.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0
3,AE,2008,50.0,0.0,0.0,6.0,1.0,7.0,5.0,3.0,...,0.0,0.0,0.0,10.0,4.0,1.0,1.0,3.0,3.0,0.0
4,AL,2005,196.0,0.0,0.0,26.0,21.0,16.0,31.0,20.0,...,0.0,0.0,0.0,3.0,9.0,5.0,5.0,5.0,18.0,0.0

In [43]:
df.drop('iso2', axis=1, inplace=True)
df.head()

,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,new_sp_m65,new_sp_mu,new_sp_f04,new_sp_f514,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,2005,5.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0
1,2006,8.0,0.0,0.0,1.0,1.0,2.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0
2,2008,3.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0
3,2008,50.0,0.0,0.0,6.0,1.0,7.0,5.0,3.0,6.0,0.0,0.0,0.0,10.0,4.0,1.0,1.0,3.0,3.0,0.0
4,2005,196.0,0.0,0.0,26.0,21.0,16.0,31.0,20.0,37.0,0.0,0.0,0.0,3.0,9.0,5.0,5.0,5.0,18.0,0.0

In [58]:
df = df.groupby('year').sum()
df.head()

,new_sp,new_sp_m04,new_sp_m514,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,new_sp_m65,new_sp_mu,new_sp_f04,new_sp_f514,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
year,,,,,,,,,,,,,,,,,,,
2005,55057.0,47.0,225.0,5280.0,7862.0,7882.0,7686.0,3986.0,3642.0,42.0,34.0,345.0,3992.0,4341.0,2679.0,1864.0,1088.0,2690.0,15.0
2006,40789.0,53.0,112.0,3843.0,5837.0,6089.0,6061.0,3229.0,3226.0,30.0,41.0,169.0,2683.0,3055.0,1874.0,1309.0,855.0,2274.0,17.0
2007,53914.0,44.0,117.0,5879.0,10659.0,11116.0,10900.0,5065.0,4312.0,17.0,22.0,226.0,4310.0,5170.0,3423.0,2388.0,1410.0,3191.0,12.0
2008,699063.0,1002.0,5092.0,67242.0,107820.0,93948.0,76711.0,46818.0,33248.0,54.0,808.0,6716.0,60639.0,75994.0,52396.0,37114.0,22551.0,20606.0,16.0